app/graphql/subscriptions/message_received.rb

    def subscribe(**_args)
      Rails.logger.info "MessageReceived.subscribe called with args: #{_args}"
      { count: Message.count }
---
SELECT COUNT(*) FROM "messages"

    def update(**_args)
      { count: Message.count }
---
SELECT COUNT(*) FROM "messages"