app/graphql/mutations/create_message.rb

INSERT INTO "messages" ("channel_id", "content", "created_at", "updated_at") VALUES ('ac9b05bf-a486-4ebb-a081-f711c15919e3', 'aiueo', '2025-05-06 19:15:42.981954', '2025-05-06 19:15:42.981954') RETURNING "id"
SELECT COUNT(*) FROM "messages"
---
    def resolve(channel:, **args)
      message = channel.messages.create!(args)

      AppSchema.subscriptions.trigger("message_received",
                                      {},
                                      { count: Message.count })